import math


def area(r):
 """
    Вычисляет площадь круга по радиусу.

    Аргументы:
        r (float): Радиус круга.

    Возвращает:
        float: Площадь круга.

    Пример вызова:
        >>> area(3)
        28.274333882308138
        >>> area(2.5)
        19.634954084936208
    """
    return math.pi * r * r


def perimeter(r):
"""
    Вычисляет длину окружности (периметр круга) по радиусу.

    Аргументы:
        r (float): Радиус круга.

    Возвращает:
        float: Длина окружности.

    Пример вызова:
        >>> perimeter(3)
        18.84955592153876
        >>> perimeter(2.5)
        15.707963267948966
    """
    return 2 * math.pi * r

