import math


def area(r):
    """
    Возвращает площадь окружности с радиусом r.

        Параметры:
            r (int): десятичное число, радиус окружности

        Возвращаемое значение:
               math.pi * r * r: число, площадь окружности с радиусом r

    """
    if r < 0:
        raise ValueError("стороны не могут быть меньше 0")
    return math.pi * r * r


def perimeter(r):
    """
    Возвращает периметр окружности с радиусом r.

        Параметры:
            r (int): число, радиус окружности

        Возвращаемое значение:
              2 * math.pi * r: число, периметр окружности с радиусом r

    """
    if r < 0:
        raise ValueError("стороны не могут быть меньше 0")
    return 2 * math.pi * r
