import math

def area(r):
    """
    Вычисляет площадь круга.

    Параметры:
        r (float): радиус круга.

    Возвращает:
        float: площадь круга.

    Пример:
        >>> area(3)
        28.274333882308138
    """
    return math.pi * r * r


def perimeter(r):
    """
    Вычисляет длину окружности.

    Параметры:
        r (float): радиус круга.

    Возвращает:
        float: длина окружности.

    Пример:
        >>> perimeter(3)
        18.84955592153876
    """
    return 2 * math.pi * r


