
def area(a, b):
    """
    Возвращает площадь прямоугольника.

        Параметры:
            a (int): первое десятичное число, длина первой стороны прямоугольнка
            b (int): второе десятичное число, длина второй стороны прямоугольника 

        Возвращаемое значение:
            a * b: число, площадь прямоугольника со стрононами a,b
    """ 
    return a * b 

def perimeter(a, b): 
    """
    Возвращает площадь прямоугольника.

        Параметры:
            a (int): первое десятичное число, длина первой стороны прямоугольнка
            b (int): второе десятичное число, длина второй стороны прямоугольника 

        Возвращаемое значение:
            2 * (a + b): число, периметр прямоугольника со стрононами a,b
    """ 
    return 2*(a + b) 
