def area(a, b):
    """
    Вычисляет площадь прямоугольника по длинам его сторон.

    Параметры:
    a (float): длина первой стороны прямоугольника.
    b (float): длина второй стороны прямоугольника.

    Возвращает:
    float: площадь прямоугольника.

    Пример вызова:
    >>> area(4, 5)
    20
    """
    return a * b

def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника по длинам его сторон.

    Параметры:
    a (float): длина первой стороны прямоугольника.
    b (float): длина второй стороны прямоугольника.

    Возвращает:
    float: периметр прямоугольника.

    Пример вызова:
    >>> perimeter(4, 5)
    18
    """
    return 2 * (a + b)

