def area(a, b):
    '''
    Возвращает площадь прямоугольника.

    Параметры:
            a (int) - первая сторона прямоугольника,
            b (int) - вторая сторона прямоугольника.
    Возвращаемое значение - результат произведения a на b (int).

    Пример вызова:
    res = area(3, 5)
    print(res)
    >> 15
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.

    Параметры:
            a (int) - первая сторона прямоугольника,
            b (int) - вторая сторона прямоугольника.
    Возвращаемое значение - удвоенная сумма сторон, что соответствует определению периметра (int).

    Пример вызова:
    res = perimeter(3, 5)
    print(res)
    >> 16
    '''
    return 2 * (a + b)
    #for tests