def area(a, b):
    """
    Вычисляет площадь прямоугольника.

    Параметры:
        a (float): длина прямоугольника.
        b (float): ширина прямоугольника.

    Возвращает:
        float: площадь прямоугольника.

    Пример:
        >>> area(3, 4)
        12
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника.

    Параметры:
        a (float): длина прямоугольника.
        b (float): ширина прямоугольника.

    Возвращает:
        float: периметр прямоугольника.

    Пример:
        >>> perimeter(3, 4)
        14
    """
    return 2 * (a + b)

