def area(a, b):
    """
    Возвращает площадь прямоугольника.

        Параметры:
            a (int): десятичное число, длинна одной из сторон прямоугольника
            b (int): десятичное число, длинна другой стороны прямоугольника

        Возвращаемое значение:
               a * b: число, площадь прямоугольника со сторонами a, b

    """
    if a < 0 or b < 0:
        raise ValueError("стороны не могут быть меньше 0")
    return a * b

def perimeter(a, b):
    """
    Возвращает периметр прямоугольника.

        Параметры:
            a (int): десятичное число, длинна одной из сторон прямоугольника
            b (int): десятичное число, длинна другой стороны прямоугольника

        Возвращаемое значение:
               (a + b) * 2: число, периметр прямоугольника со сторонами a, b

    """
    if a < 0 or b < 0:
        raise ValueError("стороны не могут быть меньше 0")
    return (a + b) * 2
