def area(a, b):
"""
    Вычисляет площадь прямоугольника по длинам сторон.

    Аргументы:
        a (float): Длина первой стороны прямоугольника.
        b (float): Длина второй стороны прямоугольника.

    Возвращает:
        float: Площадь прямоугольника.

    Пример вызова:
        >>> area(4, 5)
        20
        >>> area(3.2, 4.7)
        15.04
    """
    return a * b


def perimeter(a, b):
"""
    Вычисляет периметр прямоугольника по длинам сторон.

    Аргументы:
        a (float): Длина первой стороны прямоугольника.
        b (float): Длина второй стороны прямоугольника.

    Возвращает:
        float: Периметр прямоугольника.

    Пример вызова:
        >>> perimeter(4, 5)
        18
        >>> perimeter(3.2, 4.7)
        15.8
    """
    return 2*(a + b)
