def area(a, b):
    '''
    Находит площадь прямоугольника
    
        Параметры:
        a (float): сторона a
        b (float): сторона b
        
        Возвращаемое значение:
        area (float): площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Находит периметр прямоугольника
    
        Параметры:
        a (float): сторона a
        b (float): сторона b
        
        Возвращаемое значение:
        perimeter (float): периметр прямоугольника
    '''
    return 2 * (a + b)