
def area(a):
    """
    Вычисляет площадь квадрата по длине его стороны.

    Параметры:
    a (float): длина стороны квадрата.

    Возвращает:
    float: площадь квадрата.

    Пример вызова:
    >>> area(4)
    16
    """
    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата по длине его стороны.

    Параметры:
    a (float): длина стороны квадрата.

    Возвращает:
    float: периметр квадрата.

    Пример вызова:
    >>> perimeter(4)
    16
    """
    return 4 * a






