
def area(a):
    """
    Вычисляем площадь квадрата.
    принимаем сторону квадрата, возвращаем площадь.
    s = a*a
    
    Args:
        a(стоорона квадрата)
    Return:
        s(площадь)
    Example:
        area(5)
        25
    """
    return a * a



def perimeter(a):
    """
    Вычисляем периметр квадрата.
    принимаем сторону квадрата, возвращаем периметр.
    s = a*a
     
    Args:
        a(стоорона квадрата)
    Return:
        p(периметр)
    Example:
        perimeter(5)
        20
    """
    return 4 * a
