def area(a):
    """
    Возвращает площадь квадрата.

        Параметры:
            a (int): десятичное число, длинна стороны квадрата

        Возвращаемое значение:
               a * a: число, площадь квадрата со стороной a

    """
    if a < 0:
        raise ValueError("стороны не могут быть меньше 0")
    return a * a


def perimeter(a):
    """
    Возвращает периметр квадрата.

        Параметры:
            a (int): десятичное число, длинна стороны квадрата

        Возвращаемое значение:
               4 * a: число, периметр квадрата со стороной a

    """
    if a < 0:
        raise ValueError("стороны не могут быть меньше 0")
    return 4 * a
