
def area(a):
    """
    Возвращает площадь квадрата.

        Параметры:
            a (int): десятичное число, длина одной из сторон квадрата

        Возвращаемое значение:
            a * a: число, площадь квадрата со стороной a
    """ 
    return a * a


def perimeter(a):
    """
    Возвращает площадь квадрата.

        Параметры:
            a (int): десятичное число, длина одной из сторон квадрата

        Возвращаемое значение:
            4 * a: число, периметр квадрата со стороной a
    """ 
    return 4 * a
