def area(a):
    '''
    Возвращает площадь квадрата со стороной a

            Параметры:
                    a (float): сторона квадрата
            
            Возвращаемое значение:
                    area (float): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a

            Параметры:
                    a (float): сторона квадрата
            
            Возвращаемое значение:
                    perimeter (float): периметр квадрата со стороной a
    '''
    return 4 * a
