def area(a):
    '''
    Вычисляет площадь квадрата.
    
    Параметры:
    a (float): длина стороны квадрата
    
    Возвращаемое значение:
    float: площадь квадрата
    
    Пример вызова:
    >>> area(5)
    25.0
    >>> area(2.5)
    6.25
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата.
    
    Параметры:
    a (float): длина стороны квадрата
    
    Возвращаемое значение:
    float: периметр квадрата
    
    Пример вызова:
    >>> perimeter(5)
    20.0
    >>> perimeter(2.5)
    10.0
    '''
    return 4 * a
