def area(a, h):
    '''
    Находит площадь треугольника
    
        Параметры:
        a (float): сторона треугольника, к кторой перпендикулярна высота
        h (float): высота треугольника
        
        Возвращаемое значение:
        area (float): площадь треугольника
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Находит периметр треугольника
    
        Параметры:
        a (float): 1 сторона треугольника
        b (float): 2 сторона треугольника
        c (float): 3 сторона треугольника
        
        Возвращаемое значение:
        perimeter (float): периметр треугольника
    '''
    return a + b + c