def area(a, h):
    '''
    Возвращает площадь треугольника.

    Параметры:
            a (int) - основание треугольника,
            b (int) - высота треугольника, проведённая к основанию.
    Возвращаемое значение - результат произведения a на h, делённый на 2 (int).

    Пример вызова:
    res = area(4, 3)
    print(res)
    >> 6
    '''
    
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

    Параметры:
            a (int) - первая сторона треугольника,
            b (int) - вторая сторона треугольника,
            c (int) - третья сторона треугольника.
    Возвращаемое значение - сумма всех трёх значений сторон (int).

    Пример вызова:
    res = perimeter(3, 3, 4)
    print(res)
    >> 10
    '''
    if (a + b < c or a + c < b or b + c < a):
        print("Error: invalid triangle")
        return -1
        
    return a + b + c
#for tests