def area(a, h): 
    """
    Возвращает площадь треугольника.

        Параметры:
            a (int): первое десятичное число, длина основания треугольника
            h (int): второе десятичное число, длина высоты, проведенной к основанию треугольника

        Возвращаемое значение:
            a * h / 2: число, площадь треугольника с основанием a и высотой h
    """ 
    return a * h / 2 

def perimeter(a, b, c): 
    """
    Возвращает площадь треугольника.

        Параметры:
            a (int): первое десятичное число, длина первой стороны треугольника
            b (int): второе десятичное число, длина второй стороны треугольника
            c (int): третье десятичное число, длина третьей стороны треугольника

        Возвращаемое значение:
            a * h / 2: число, периметр треугольника со сторонами a, b и с
    """ 
    return a + b + c 
