def area(a, h):
    """
    Вычисляет площадь треугольника по длине основания и высоте.

    Параметры:
    a (float): длина основания треугольника.
    h (float): высота треугольника.

    Возвращает:
    float: площадь треугольника.

    Пример вызова:
    >>> area(4, 5)
    10.0
    """
    return 0.5 * a * h

def perimeter(a, b, c):
    """
    Вычисляет периметр треугольника по длинам его сторон.

    Параметры:
    a (float): длина первой стороны треугольника.
    b (float): длина второй стороны треугольника.
    c (float): длина третьей стороны треугольника.

    Возвращает:
    float: периметр треугольника.

    Пример вызова:
    >>> perimeter(3, 4, 5)
    12
    """
    return a + b + c