def area(a, h):
    """
    Возвращает площадь треугольника.

        Параметры:
            a (int): десятичное число, длинна основания треугольника
            h (int): десятичное число, длинна высоты, проведённой к основанию длинной a

        Возвращаемое значение:
               a * h / 2: число, площадь треугольника со стороной a и высотой h

    """
    if a < 0 or h < 0:
        raise ValueError("стороны не могут быть меньше 0")
    return a * h / 2

def perimeter(a, b, c):
    """
    Возвращает периметр треугольника.

        Параметры:
            a (int): десятичное число, длинна стороны треугольника
            b (int): десятичное число, длинна стороны треугольника
            c (int): десятичное число, длинна стороны треугольника

        Возвращаемое значение:
               a + b + c: число, периметр треугольника со сторонами a, b, c
    """
    if a < 0 or b < 0 or c < 0:
        raise ValueError("стороны не могут быть меньше 0")
    return a + b + c
