def area(a, h):
    '''
    Возвращает площадь треугольника
    Праметры:
        a (float)- основание
        h (float)- высота
    Возвращаемое значение:
        Площадь треугольника (float)
    '''
    return a * h / 2
def perimetr(a, b, c):
    '''
    Возвращает периметр треугольника
    Праметры:
        a (float)- длинна первой стороны
        b (float)- длинна второй стороны
        c (float)- длинна третьей стороны
    Возвращаемое значение:
        Периметр треугольника (float)
    '''
    return a + b + c